test/http_recordings/get_customer_charges.json

[
  {
    "request": {
      "body": "{\"token\":null,\"email\":\"hagrid@hogwarts.wiz\",\"card_token\":null,\"card\":{\"token\":null,\"number\":\"5520000000000000\",\"name\":\"Rubius Hagrid\",\"expiry_year\":\"20\",\"expiry_month\":\"12\",\"cvc\":\"321\",\"address_state\":null,\"address_postcode\":null,\"address_line2\":null,\"address_line1\":\"The Game Keepers Cottage\",\"address_country\":\"England\",\"address_city\":\"Hogwarts\"}}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/customers"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"cus_GRi-xUCRk_R2kchzFR7_lA\",\"email\":\"hagrid@hogwarts.wiz\",\"created_at\":\"2018-05-21T14:22:08Z\",\"card\":{\"token\":\"card_4CToAHDg8FqzrJsh7Iv_jQ\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":\"cus_GRi-xUCRk_R2kchzFR7_lA\",\"primary\":true}}}",
      "headers": {
        "Date": "Mon, 21 May 2018 14:22:08 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "505",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"44798229d4ed442918a66c0eb41acb83\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "5f30123b-9560-426e-8435-2d17f2a1d9d6",
        "X-Runtime": "0.056955",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "{\"transfer\":null,\"total_fees\":null,\"settlement_currency\":null,\"refund_pending\":null,\"metadata\":null,\"merchant_entitlement\":null,\"ip_address\":\"127.0.0.1\",\"email\":\"hagrid@hogwarts.wiz\",\"description\":\"Dragon eggs\",\"customer_token\":\"cus_GRi-xUCRk_R2kchzFR7_lA\",\"currency\":null,\"card_token\":null,\"card\":null,\"captured\":null,\"capture\":null,\"authorisation_expired\":null,\"amount_refunded\":null,\"amount\":50000}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"ch_FGO8IADMzWXK7PtSM7mO6A\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T14:22:08Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_4CToAHDg8FqzrJsh7Iv_jQ\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":\"cus_GRi-xUCRk_R2kchzFR7_lA\",\"primary\":true},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}}}",
      "headers": {
        "Date": "Mon, 21 May 2018 14:22:09 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "844",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"d69ead8572ca4eab7aa9dff82491e93e\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "3e8a1403-5503-4103-bd97-d37abef8e8c0",
        "X-Runtime": "0.221325",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "\"\"",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/customers/cus_GRi-xUCRk_R2kchzFR7_lA/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":[{\"token\":\"ch_FGO8IADMzWXK7PtSM7mO6A\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T14:22:08Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_4CToAHDg8FqzrJsh7Iv_jQ\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":\"cus_GRi-xUCRk_R2kchzFR7_lA\",\"primary\":true},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}}],\"count\":1,\"pagination\":{\"current\":1,\"previous\":null,\"next\":null,\"per_page\":25,\"pages\":1,\"count\":1}}",
      "headers": {
        "Date": "Mon, 21 May 2018 14:22:09 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "945",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"50daddd62674f589e5a59b022e1c1155\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "4f4f3b96-ee0e-4cdb-98dd-396f2d9a65f8",
        "X-Runtime": "0.051438",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]